// Task-2-2-ru.cpp : Этот файл содержит функцию 'main'. Выполнение программы начинается и заканчивается здесь.
//

#include <iostream>
#include <locale>

int main(int argc, char* args[])
{
    unsigned int prev; // первая высота
    unsigned int curr; // вторая высота
    unsigned int next_val; // третья высота
    unsigned int peaks_count = 0;  // счётчик пиков
    bool b_done = false;  // флаг окончания цикла
    // Установка русской локали для терминала Windows 11
    system("chcp 65001 >nul");// 1-й способ. Выплнить внешнюю команду.
    setlocale(LC_ALL, "russian.65001"); // 2 - й способ. Вызов библиотечной функции.
    std::locale rus_locale = std::locale("russian.65001"); // 3 - й способ. Создать переменную типа локали
    std::cout.imbue(std::locale::global(rus_locale)); // 3 - й способ. Выбор кодировки(локали) терминала
    // Ввод данных
    // Вывод подсказки на экран
    std::cout << "Введите данные радарной станции (0 - конец ввода).\r\n";
    // Считываем первые два элемента
    std::cin >> prev;  // ввод первой высоты
    std::cin >> curr;  // ввод второй высоты
    while (!b_done)
    {
        std::cin >> next_val;  // ввод третьей высоты
        // Если встретили 0, ввод окончен
        b_done = (next_val == 0);  // условие окончания цикла
        // Проверяем условие пика для текущего элемента
        if (!b_done && (curr > prev) && (curr > next_val))
        {
            peaks_count += 1;  // счётчик пиков увеличили на 1
        }
        // Сдвигаем «окно» из трёх элементов вперед
        prev = curr;
        curr = next_val;
    }
    std::cout << "Количество пиков: " << peaks_count << "\r\n";  // вывод на экран
    // Задержка вывода на экран до нажатия клавиши "Ввод"
    std::cin.ignore();
    std::cin.get();
    return 0;
}

// Запуск программы: Ctrl + F5 или меню «Отладка» > «Запустить без отладки»
// Отладка программы: F5 или меню «Отладка» > «Запустить отладку»
// Советы по началу работы:
// 1. Используйте окно «Обозреватель решений» для добавления/управления файлами
// 2. Используйте окно «Обозреватель команд» для подключения к системе контроля версий
// 3. Используйте окно «Вывод», чтобы просмотреть результаты сборки и другие сообщения
// 4. Используйте окно «Список ошибок», чтобы просмотреть ошибки
// 5. Перейдите в меню «Проект» > «Добавить новый элемент», чтобы создать новые файлы кода, 
//    или в меню «Проект» > «Добавить существующий элемент», чтобы добавить существующие файлы кода в проект